/*
┌──────────────────────────────────────────────────────────────┐
│　描   述：枚举聚合函数.
│　作   者：Obase开发团队
│　版权所有：武汉乐程软工科技有限公司
│　创建时间：2026-1-7 17:42:49
└──────────────────────────────────────────────────────────────┘
*/
package io.obase.providers.sql.sqlobject;

/**
 * 枚举聚合函数
 */
public enum EAggregationFunction {

    /**
     * 不执行任何聚合操作
     */
    None,

    /**
     * 求平均值
     */
    Average,

    /**
     * 统计个数
     */
    Count,

    /**
     * 取最大值
     */
    Max,

    /**
     * 取最小值
     */
    Min,

    /**
     * 算术累加
     */
    Sum
}
